#!/usr/bin/python
# encoding: utf-8

from combo import combo
from allKanji import *


u = ['夘','鵜','卯','有','優','右','羽','宇','雨','祐','胡','烏','佑','芋','謳','迂','于','侑','傴','吁','嗚','塢','嫗','挧','桙','燠','盂','禹','紆','齲','偊','噁','噢','圩','圬','埡','妋','姷','弙','扜','摳','杅','杇','栯','櫌','歍','洿','浟','漚','瀀','熰','玗','琇','瑀','瑦','痀','痏','盱','竽','耰','茡','蓲','虶','螐','迶','邘','鄅','鄔','釪','隖','雩','饇','骬','鰞']
ri = ['理','利','離','裏','里','李','梨','栗','履','痢','黎','鯉','狸','浬','哩','莱','吏','璃','裡','俚','俐','悧','罹','漓','犂','犁','籬','茘','莅','莉','蜊','蠡','詈','貍','釐','驪','黐','刕','唎','嚟','娌','嫠','孋','峲','悝','悷','摛','攦','柂','梩','欐','氂','浰','涖','灕','犛','猍','瓈','盠','砅','离','縭','纚','艃','荔','萊','蒞','薶','蘺','蟸','褵','躧','邐','酈','醨']
a = ['阿','亜','窪','唖','娃','蛙','亞','哇','堊','婀','猗','痾','襾','錏','鐚','閼','鴉','丫','伌','侉','劸','啊','啞','婭','屙','徍','氬','疴','瘂','鈳','鵶']
i = ['眤','藺','豬','胘','猪','莞','汝','檍','亥','猪','井','意','以','委','位','違','医','移','易','異','維','遺','伊','囲','為','依','威','慰','衣','唯','緯','偉','胃','蛇','鋳','尉','倭','斐','已','椅','惟','夷','葦','畏','壬','飴','萎','謂','蔚','詑','陀','鮪','佗','倚','噫','囗','圍','姨','帷','幃','彝','彜','彙','怡','恚','懿','欹','洟','渭','熨','爲','猗','痍','痿','矣','縊','肄','苡','蝟','詒','貽','逶','醫','靉','韋','頤','餒','饐','鰄','乁','勩','匜','叕','叞','吚','咦','咿','唉','喂','嘻','圩','圯','坨','壝','夤','她','媐','媙','崣','崴','巸','异','弬','彛','徫','悘','愇','扆','拕','拖','拪','撝','攺','旖','暐','曀','杝','枱','柂','椸','楲','歖','毉','汜','沇','洧','涹','湋','漪','潙','濰','煒','犄','猬','珆','瑋','痏','眙','碨','磈','禕','簃','緆','緭','繄','羡','胰','芛','苐','苢','荑','荽','葳','蔿','薏','虵','蛜','蜲','蜼','螠','螱','蠵','袘','褘','訑','誃','誒','諉','譆','讄','貐','貤','迆','迤','迱','迻','酏','鈶','鉯','鉹','銥','鐿','闈','陁','霨','韑','韙','韡','頥','顊','餧','餵','騃','騧','骪','鮐','鮧','鮷','鯷','鴺','鷕','鷧','鷾','黟','廙']
ka = ['化','下','和','加','家','価','果','過','可','何','個','課','歌','突','科','火','花','夏','河','貨','仮','甲','華','偽','荷','稼','暇','嘉','架','靴','嫁','霞','佳','菓','渦','鍋','伐','榎','樺','禍','寡','迦','珂','伽','厦','瓜','禾','箇','苛','茄','嘩','駕','卦','袈','跨','个','假','僞','價','呀','呵','咼','哥','囮','堝','夥','夭','夸','崋','廈','彁','戈','枷','柯','柧','渮','珈','瑕','痂','窩','笳','罅','胯','舸','葭','萪','蝸','蝌','裹','訛','訶','謌','譁','譌','谺','賈','跏','踝','軻','遐','錵','鍜','顆','鰕','丅','伙','佉','侉','俰','倮','傠','傢','冎','划','剮','卡','叚','叧','吓','吪','呿','咖','哬','哿','喎','嘏','坷','夓','姱','婐','媧','宊','岈','岢','嵙','恗','惈','戓','撾','斝','棵','椵','檟','涴','灬','煆','牁','牫','牱','猓','猧','疜','瘕','瘸','盉','砢','碬','稞','窠','笴','粿','絓','綶','縀','緺','耞','胍','腡','芲','荂','菏','蔿','蕐','蚜','蚵','蜾','蠃','詿','誮','諕','謑','豗','豭','赮','輠','鈥','鈳','銙','鋘','鎵','鎶','鞾','餜','騢','騧','驊','骻','髁','鮬','龢','吤','禍','蝦','日','香','鹿','也','蚊','乎','斯','耶','歟','蚋','馥','欤','蜹','蟁','蚉']
mi = ['味','美','未','魅','弥','眉','麼','弭','彌','瀰','縻','靡','黴','亹','侎','劘','咩','哶','娓','媺','敉','楣','渼','湄','獼','眯','睂','穈','羋','蘼','郿','镾','鬽','鮇','媄','三','実','身','箕','巳','實','躬','弎','盁','籮','躳']


theCombo = combo()

def ruuri(theCombo):
    for eachCombo in theCombo:
        aString = '('
        for stroke in strokeNumbers:
            if stroke[0] == str(eachCombo[0]):
                for sound in u:
                    if sound in stroke:
                        aString += sound
        aString += ':'
        for stroke in strokeNumbers:
            if stroke[0] == str(eachCombo[1]):
                for sound in ri:
                    if sound in stroke:
                        aString += sound
        aString += ')'
        if aString.index(':') > 1 and aString.index(')') - aString.index(':') > 1:
            print aString
            print

def ruika(theCombo):
    for eachCombo in theCombo:
        aString = '('
        for stroke in strokeNumbers:
            if stroke[0] == str(eachCombo[0]):
                for sound in i:
                    if sound in stroke:
                        aString += sound
        aString += ':'
        for stroke in strokeNumbers:
            if stroke[0] == str(eachCombo[1]):
                for sound in ka:
                    if sound in stroke:
                        aString += sound
        aString += ')'
        if aString.index(':') > 1 and aString.index(')') - aString.index(':') > 1:
            print aString
            print

def rua():
    for stroke in strokeNumbers:
        for sound in a:
            if sound in stroke:
                print sound

ruika()
                